app/controllers/consultas_controller.rb

  def index
    @consultas = Consulta.paginate :page => params[:page],  :per_page => 5
---
SELECT * FROM "consultas" WHERE (data >= '2010-09-15 11:51:47.619264' AND (horario > '2010-09-15 11:51:47.619268' AND horario <= '19:00')) ORDER BY horario LIMIT 3

  def show
    @consulta = Consulta.find(params[:id])
---
SELECT * FROM "consultas" WHERE ("consultas"."id" = 1)

  def edit
    @consulta = Consulta.find(params[:id])
---
SELECT * FROM "consultas" WHERE ("consultas"."id" = 1)

  def create
    @consulta = Consulta.new(params[:consulta])

    respond_to do |format|
      if @consulta.save
---
INSERT INTO "consultas" ("data", "created_at", "nome_plano", "tipo_consulta", "paciente_id", "updated_at", "horario", "preco", "medico_id", "tipo_plano") VALUES('2010-09-01', '2010-09-01 18:54:17.557415', '', '', NULL, '2010-09-01 18:54:17.557415', '2010-09-01 18:54:00.000000', NULL, NULL, '') RETURNING "id"

  def update
    @consulta = Consulta.find(params[:id])

    respond_to do |format|
      if @consulta.update_attributes(params[:consulta])
---
SELECT * FROM "consultas" WHERE ("consultas"."id" = 5)
UPDATE "consultas" SET "updated_at" = '2010-09-15 14:34:53.709427', "horario" = '2000-01-01 20:00:00.000000' WHERE "id" = 5

  def destroy
    @consulta = Consulta.find(params[:id])
    @consulta.destroy
---
SELECT * FROM "consultas" WHERE ("consultas"."id" = 1)
DELETE FROM "consultas" WHERE "id" = 1