app/controllers/exames_controller.rb

SELECT * FROM "exames"
---
  def index
    @exames = Exame.all