app/controllers/medicos_controller.rb

SELECT * FROM "medicos" LIMIT 5 OFFSET 0
---
  def index
    @medicos = Medico.paginate :page => params[:page],  :per_page => 5

SELECT * FROM "medicos" WHERE ("medicos"."id" = 1)
---
  def show
    @medico = Medico.find(params[:id])

SELECT * FROM "medicos" WHERE ("medicos"."id" = 1)
---
  def edit
    @medico = Medico.find(params[:id])

INSERT INTO "medicos" ("created_at", "nome", "picture_content_type", "updated_at", "picture_updated_at", "picture_file_name", "picture_file_size", "especialidade") VALUES('2010-09-13 16:09:25.334049', '', 'image/jpeg', '2010-09-13 16:09:25.334049', '2010-09-13 16:09:24.839218', 'jqn.jpeg', 6269, '') RETURNING "id"
---
  def create
    @medico = Medico.new(params[:medico])

    respond_to do |format|
      if @medico.save

SELECT * FROM "medicos" WHERE ("medicos"."id" = 1)
UPDATE "medicos" SET "updated_at" = '2010-09-13 23:47:37.076626', "especialidade" = 'Gastroenterologia', "nome" = 'José Roberto Crespo de Souza' WHERE "id" = 2
---
  def update
    @medico = Medico.find(params[:id])

    respond_to do |format|
      if @medico.update_attributes(params[:medico])

SELECT * FROM "medicos" WHERE ("medicos"."id" = 1)
DELETE FROM "medicos" WHERE "id" = 1
---
  def destroy
    @medico = Medico.find(params[:id])
    @medico.destroy