app/controllers/medicamentos_controller.rb

  def index
    @medicamentos = Medicamento.all
---
SELECT * FROM "medicamentos"