app/controllers/pacientes_controller.rb

  def index
    @pacientes = Paciente.paginate :page => params[:page],  :per_page => 10
---
SELECT * FROM "pacientes" LIMIT 10 OFFSET 0

  def show
    @paciente = Paciente.find(params[:id])
---
SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 1)

  def edit
    @paciente = Paciente.find(params[:id])
---
SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 2)

  def create
    @paciente = Paciente.new(params[:paciente])

    respond_to do |format|
      if @paciente.save
---
INSERT INTO "pacientes" ("complemento", "telefone", "created_at", "nome", "cep", "cpf", "updated_at", "plano_de_saude", "bairro", "rua", "numero", "cidade", "estado", "tipo_de_plano", "celular", "data_de_nascimento", "rg", "email") VALUES('', '', '2010-10-02 17:20:18.352076', 'Rafael Barcellos Pessanha Crespo', '28010400', '127.978.277-32', '2010-10-02 17:20:18.352076', NULL, 'Centro', 'Rua Gilberto Siqueira', '', 'Campos dos Goytacazes', 'RJ', NULL, '', NULL, '20.991.231-0', NULL) RETURNING "id"

  def update
    @paciente = Paciente.find(params[:id])

    respond_to do |format|
      if @paciente.update_attributes(params[:paciente])
---
SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 2)
UPDATE "pacientes" SET "updated_at" = '2010-10-02 17:29:09.896158', "tipo_de_plano" = 'Basico', "plano_de_saude" = 'Unimed' WHERE "id" = 1

  def destroy
    @paciente = Paciente.find(params[:id])
    @paciente.destroy
---
SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 3)
DELETE FROM "pacientes" WHERE "id" = 3