app/controllers/prontuarios_controller.rb

SELECT * FROM "prontuarios"
---
  def index
    @prontuarios = Prontuario.all